In [12]:
import pandas as pd

#### Data Frames

* Rows & Columns

In [13]:
import pandas as pd

In [15]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
# Create Dataframe

myfirstdataset = {
  'name': ["tom", "jerry", "spike",'abc','def','fgjs','dsadfa','asdskjdf'],
  'age': [10, 12, 14, 15,16,15,50,80]
}

dataframe = pd.DataFrame(myfirstdataset)
dataframe
#print(dataframe)

       name  age
0       tom   10
1     jerry   12
2     spike   14
3       abc   15
4       def   16
5      fgjs   15
6    dsadfa   50
7  asdskjdf   80

In [18]:
abc = [['tom',10],['jerry',12],['spike',14]]

df = pd.DataFrame(abc,['a','b','c'],columns = ['Name','Age'])  #,dtype=float
df

    Name  Age
a    tom   10
b  jerry   12
c  spike   14

In [34]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [35]:
data = [{'a': 5, 'b': 10, 'c': 20},
        {'a': 1, 'b': 2},
        {'a': 1, 'b': 2,'c':10,'d':70}]
df = pd.DataFrame(data)
df

   a   b     c     d
0  5  10  20.0   NaN
1  1   2   NaN   NaN
2  1   2  10.0  70.0

In [45]:
data = [{'a': 5, 'b': 10, 'c': 20},
        {'a': 1, 'b': 2},
        {'a': 1, 'b': 2,'c':10,'d':70}]
df = pd.DataFrame(data)
df

   a   b     c     d
0  5  10  20.0   NaN
1  1   2   NaN   NaN
2  1   2  10.0  70.0

In [46]:
pd.Series([10,20,30,40,50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [47]:
df['e'] = pd.Series([10,20,30,40,50])
df

   a   b     c     d   e
0  5  10  20.0   NaN  10
1  1   2   NaN   NaN  20
2  1   2  10.0  70.0  30

#### Slicing - loc & iloc

* label & integer / integrr
* list of labels / list of integers
* [A:B] both included / B excluded
* loc[row_label, column_label] / iloc[row_position, column_position]

* iloc - both intgers
* loc - row can be intger/label, column - label

In [ ]:
df.loc[    row condition  ,  column condition  ]

In [ ]:
import pandas as pd

In [20]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)
#df

In [21]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [22]:
df.iloc[1:3,1:3]

   two  three
1   20    200
2   30    300

In [23]:
df.loc[1:3,'two':'four']

   two  three  four
1   20    200  2000
2   30    300  3000
3   40    400  4000

In [24]:
df.loc[1:2,'two':'three']

   two  three
1   20    200
2   30    300

In [ ]:
# loc[row_index , column_index]
# iloc[row_index , column_index]

# iloc - always takes  m-1 as output.

In [ ]:
df.iloc[1:3,1:3]

In [ ]:
df.loc[1:3,'two':'four']

In [ ]:
df.iloc[[0,2],[1,3]]

In [ ]:
df.loc[[0,2],['two','four']]

In [ ]:
df.iloc[[0,3],1:3]

In [ ]:
df.loc[[0,3],'two':'four']

In [ ]:
df

In [ ]:
# data for colum three & four where the value of column two is more than 20

df.loc[ df['two'] >20, ['three','four']]

In [ ]:
loc [ row , colum]

In [ ]:
df

In [ ]:
# data for column one & four where value of three is less than 500

In [ ]:
df.loc[df['three'] < 300, ['one','four']]

In [ ]:
df.iloc[0,1:3]

# 0 index value (1st row)
# data from the columns between two & four, -- two three & four

In [ ]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),}
df = pd.DataFrame(data)


# pd.read_csv

In [ ]:
df.iloc[[0,3,1],1:3]

In [ ]:
# All the rows where column two value > 20

##### ways to access columns
1. df['column name']
2. df.column_name

In [ ]:
df.loc[df['two'] >20, ['two','three']]

In [ ]:
# List of values   ##loc/iloc[:,[,]]
df.loc[[0,3,1],['one','three']]

In [27]:
df[['two','three']]

   two  three
0   10    100
1   20    200
2   30    300
3   40    400

##### Pandas Data frame computations

In [28]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)

In [29]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

* Column addition

In [30]:
# need another column 5 and pass the data externally -- name 'five'

df['five'] = pd.Series([150,250,350,450])

In [31]:
df

   one  two  three  four  five
0    1   10    100  1000   150
1    2   20    200  2000   250
2    3   30    300  3000   350
3    4   40    400  4000   450

In [33]:
df['six'] = pd.Series(['a','b','c'])
df

   one  two  three  four  five  six
0    1   10    100  1000   150    a
1    2   20    200  2000   250    b
2    3   30    300  3000   350    c
3    4   40    400  4000   450  NaN

In [ ]:
# Some computation on existing data
# new column seven, - multiplication of column one & two
        # 10,40,90,160
    
df['seven'] = df['one'] * df['two']
df

* Column deletion

In [ ]:
df

In [ ]:
# Column Deletion
## using del function  del df['']

del df['six']
df

#### Addition of rows (Append)

In [ ]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df1

In [ ]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df2

In [ ]:
df3 = df1.append(df2).reset_index(drop=True)
df3

#### Drop

In [ ]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)

In [ ]:
df

* axis =0 => Rows (row wise)
* axis =1 => Columns (column wise)

In [ ]:
df.drop(['one','three'],axis=1)

In [ ]:
df = df.drop

In [ ]:
df.drop(columns = ['one','four'], inplace =True)

In [ ]:
df

#### Data frame functionalities

In [48]:
d = {'Name':pd.Series(['Tom','Jerry','Spike','Popeye','Olive','Bluto','Mickey']),
   'Age':pd.Series([10,12,14,30,28,33,15]),
   'Height':pd.Series([3.25,1.11,4.12,5.47,6.15,6.67,2.61])}

df = pd.DataFrame(d)
df

     Name  Age  Height
0     Tom   10    3.25
1   Jerry   12    1.11
2   Spike   14    4.12
3  Popeye   30    5.47
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [ ]:
df.loc[0:3,['Name','Age']].T

In [ ]:
# Important functionalities of DF. 

# 1. T (Transposes rows and columns.)

df.T

In [ ]:
# 2. axes (Returns a list with the row and column axis variables)
df.axes

In [ ]:
# 3. ndim (Number of axes)

In [ ]:
df.ndim

In [ ]:
# 4. dtypes (Returns the dtypes of objects)

In [49]:
df.dtypes

Name       object
Age         int64
Height    float64
dtype: object

In [ ]:
# 5. shape (Returns the dimension of data)

In [50]:
df.shape

(7, 3)

In [ ]:
print('My dataframe has {} rows and {} columns'.format(df.shape[0],df.shape[1]))

In [52]:
# 6. head() (Returns the first n rows)
df.head(2)

    Name  Age  Height
0    Tom   10    3.25
1  Jerry   12    1.11

In [ ]:
# 7. tail() (Returns last n rows.)

In [ ]:
df.tail(3)

In [ ]:
# 8. empty() (Returns true if DF is empty)

In [ ]:
df

In [ ]:
df[['Age','Height']].max()

In [ ]:
## Descriptive Stats

# .sum()  (Returns sum on by default axis 0)

In [ ]:
# .sum(1) (on axis =1, columns)

In [ ]:
# .mean() (Returns avg value per column)

In [ ]:
# .mode() (Returns mode value per column)

In [ ]:
# .std()  (Returns std per column)

In [ ]:
# .min()/max()/abs()/prod()

* Describe ()

In [55]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000]),
    'five' : pd.Series(['A','B','C','D'])}

df = pd.DataFrame(data)

In [56]:
df.describe(include='all')

             one        two       three         four five
count   4.000000   4.000000    4.000000     4.000000    4
unique       NaN        NaN         NaN          NaN    4
top          NaN        NaN         NaN          NaN    A
freq         NaN        NaN         NaN          NaN    1
mean    2.500000  25.000000  250.000000  2500.000000  NaN
std     1.290994  12.909944  129.099445  1290.994449  NaN
min     1.000000  10.000000  100.000000  1000.000000  NaN
25%     1.750000  17.500000  175.000000  1750.000000  NaN
50%     2.500000  25.000000  250.000000  2500.000000  NaN
75%     3.250000  32.500000  325.000000  3250.000000  NaN
max     4.000000  40.000000  400.000000  4000.000000  NaN

In [ ]:
df.describe(percentiles=[0.75,0.80,0.85,0.9,0.95,0.99])

###### Rename ()

In [60]:
data = {'one' : pd.Series([1, 2, 3, 4]),
   'two' : pd.Series([10, 20, 30, 40]),
   'three' : pd.Series([100, 200, 300, 400]),
    'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
#df

#{original : changed}

In [61]:
df.rename(columns = {'one' : 'one_' , 'two' : 'two_'} , index = {0:'a',1:'b'}, inplace = True)

   one_  two_  three  four
a     1    10    100  1000
b     2    20    200  2000
2     3    30    300  3000
3     4    40    400  4000

In [62]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

##### Sorting with Pandas

In [ ]:
import numpy as np

unsorted_df=pd.DataFrame(np.random.rand(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col1','col2'])
print(unsorted_df)

In [ ]:
# Sort Index
sorted_df=unsorted_df.sort_index(ascending = True)
print(sorted_df)

In [ ]:
unsorted_df

In [ ]:
sorted_df = unsorted_df.sort_values(by='col1')
sorted_df = sorted_df.reset_index(drop = True)
sorted_df

##### Questions

In [ ]:
import pandas as pd
  
# assign data
data = {'Name': ['Arpit','Manish','Joy','Rohit','Virat','Shreya'],
        'Age': [30, 35, 37, 33, 34, 30],
        'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
        'Designation': ['Engineer','Artist','Painter','Singer','Designer','Dancer']}




df = pd.DataFrame(data)
df

In [ ]:
#Q1. Display the name and age of the employees where salary is less than mean salary

In [ ]:
df.loc[df['Salary'] < df['Salary'].mean(),['Name','Age']]

In [ ]:
# assign data
data = {'Name': ['Arpit','Manish','Joy','Rohit','Virat','Shreya'],
        'Age': [30, 35, 37, 33, 34, 30],
        'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
        'Designation': ['Engineer','Artist','Painter','Singer','Designer','Dancer']}




df = pd.DataFrame(data)
df

In [ ]:
#Q2. Display the name and age of the employees where salary is >100000 & Age is less than 40

In [ ]:
# 2 conditions
## Salary > 100000
## Age < 40

In [ ]:
import pandas as pd

In [ ]:
data = {'Name': ['Arpit','Manish','Joy','Rohit','Virat','Shreya'],
        'Age': [30, 35, 37, 33, 34, 30],
        'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
        'Designation': ['Engineer','Artist','Painter','Singer','Designer','Dancer']}



df = pd.DataFrame(data)
df

#### Pandas Groupby

Groupby performs following operations 
   * Splitting the data in groups
   * Applying the compute functions 
        * Aggregations (Summary stats)
        * Transformations (Group level changes)
        * Filterations (POI)

In [63]:
import pandas as pd

cricket = {'Team': ['India', 'India', 'Australia', 'Australia', 'SA',
   'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
   'Rank': [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,801,891,815,776,784,834,824,758,691,883,782]}
df = pd.DataFrame(cricket)

In [64]:
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [ ]:
df.sort_values(by = ['Team','Year'])

    Ways to Split the data

        1. df.groupby('key')
        2. df.groupby(['key1','key2'])

In [ ]:
df

In [65]:
df.groupby('Team')

In [66]:
# 1st way

   # Groupby object

## View 
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [67]:
df.groupby('Team')

In [68]:
df.groupby('Team').get_group('Australia')

        Team  Rank  Year  Points
2  Australia     1  2014     891
3  Australia     2  2015     815

In [ ]:
df

In [ ]:
df.groupby(['Team','Year']).groups

In [ ]:
df.groupby(['Team','Year']).get_group(('Australia', 2014))

In [ ]:
# 2nd way 
#df.groupby(['Team','Year']).groups

In [ ]:
group = df.groupby('Year')
#group.get_group(2015)
#df.groupby(['Team','Rank']).get_group(('India', 2))

* Aggregation

In [69]:
import numpy as np
#Checking data points available per team

group = df.groupby('Team')
group.agg(np.size)

           Rank  Year  Points
Team
Australia     2     2       2
India         3     3       3
NZ            3     3       3
SA            4     4       4

In [70]:
# Checking multiple stats for points team wise

group = df.groupby('Team')
group['Points'].agg([np.sum, np.mean, np.std])

            sum        mean        std
Team
Australia  1706  853.000000  53.740115
India      2459  819.666667  49.702448
NZ         2332  777.333333  97.449132
SA         3218  804.500000  28.769196

In [71]:
df.groupby(['Team'])['Points'].mean()

Team
Australia    853.000000
India        819.666667
NZ           777.333333
SA           804.500000
Name: Points, dtype: float64

In [72]:
# Multiple columns Syntax
df = pd.DataFrame(np.random.rand(4,4), columns=list('abcd'))
df['group'] = [0, 0, 1, 1]
df

          a         b         c         d  group
0  0.538595  0.503132  0.491584  0.391423      0
1  0.261740  0.892106  0.101504  0.635824      0
2  0.617942  0.191312  0.707055  0.349322      1
3  0.685321  0.787977  0.537753  0.717335      1

In [73]:
df.groupby('group').agg({'a':['sum', 'max'], 
                         'b':'mean', 
                         'c':'sum', 
                         'd': lambda x: x.max() - x.min()})

              a                   b         c         d
            sum       max      mean       sum  <lambda>
group
0      0.800335  0.538595  0.697619  0.593088  0.244401
1      1.303263  0.685321  0.489644  1.244807  0.368013

* Filter

In [ ]:
df

In [ ]:
# Filter data where minimum data points for team is 3
group = df.groupby('Team')
df.groupby('Team').filter(lambda x: len(x) >= 3)

In [74]:
d1 = {'Shows':['Stranger Things','GOT','HOD'],
     'Ratings':[9.1,9.4,9.6]}

d2 = {'Shows':['Stranger Things','GOT','Breaking Bad','Narcos'],
     'Ratings':[9.1,9.4,9.2,8.9]}

df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [75]:
df1

             Shows  Ratings
0  Stranger Things      9.1
1              GOT      9.4
2              HOD      9.6

In [76]:
df2

             Shows  Ratings
0  Stranger Things      9.1
1              GOT      9.4
2     Breaking Bad      9.2
3           Narcos      8.9

In [79]:
pd.merge(df1,df2,how='left',on='Shows',suffixes=('_left', '_right'))

             Shows  Ratings_left  Ratings_right
0  Stranger Things           9.1            9.1
1              GOT           9.4            9.4
2              HOD           9.6            NaN

In [80]:
### Union 

d1 = {'Name' : ['Arpit','Rohit'],
      'Age' : [30,35]}
d2 = {'Name' : ['Ankit','Shreya'],
      'Age' : [25,31]}
d3 = {'Name' : ['Ron','Jane'],
      'Age' : [41,45]}

df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)
df3 = pd.DataFrame(d3)

In [81]:
df1

    Name  Age
0  Arpit   30
1  Rohit   35

In [82]:
df2

     Name  Age
0   Ankit   25
1  Shreya   31

In [83]:
df3

   Name  Age
0   Ron   41
1  Jane   45

In [86]:
pd.concat([df1,df2,df3]).reset_index(drop = True)

     Name  Age
0   Arpit   30
1   Rohit   35
2   Ankit   25
3  Shreya   31
4     Ron   41
5    Jane   45